<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b51914c0ef8ebe7219df003822dda8348edd6043ed034b8b0b3d2376293569b4","plan_job_ref":"Job Plan Airflow DAGs #8 at https://github.com/cal-itp/data-infra/actions/runs/14588770606","plan_out_hash":"1b03c30b0066828a153c0bf0d748269e50e314d75f11a12d5440c60ddd930781","plan_hash":"85d4d62be19995274964664239faf37cea8b92e79314d5b4bfe0c1c16f1e39d5","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_products.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "y4IjmA==" -> (known after apply)
!~      detect_md5hash      = "D1mpXhITd053Xy3zHjt1lQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "D1mpXhITd053Xy3zHjt1lQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcreate_external_tables%2Fairtable%2Fexternal_airtable_transit_tech_stacks_products.yml?generation=1744830292842869&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_products.yml"
!~      output_name         = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_products.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcreate_external_tables%2Fairtable%2Fexternal_airtable_transit_tech_stacks_products.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #8](https://github.com/cal-itp/data-infra/actions/runs/14588770606)